src/cf/src/DataProcessors/ТестовыеДанные/ТестовыеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТестовыеДанные</name>
  <comment>Технологическая обработка подсистемы «Автотесты»: заводит недостающие образцы объектов для прогона печати. ЗАПИСЫВАЕТ данные, запускается только на тестовой базе параметром /C "ТестовыеДанные;путь-к-отчёту", см. docs/TESTING.md.</comment>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/Лиды/Лиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лиды</name>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Канал</name>
    <type>
      <types>CatalogRef.Каналы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЛидов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ВидыЗаказовПоставщику/ВидыЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗаказовПоставщику</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Предварительный</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ДоговорыСКонтрагентами/ДоговорыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыСКонтрагентами</name>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчётов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчётыВУсловныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Субподрядчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/DataProcessors/ТестовыеДанные/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверная часть подсистемы «Автотесты»: образцы объектов для прогона печати.
// Второй проход смока проверяет печатную форму только там, где в базе есть хотя бы
// один объект; эта обработка заводит недостающие образцы - по одному на объект.
//
// Обработка ЗАПИСЫВАЕТ данные: запускать только на тестовой базе (scripts/fixtures.sh).
// Регламент - docs/TESTING.md.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заводит образец для каждого объекта с командами печати, у которого в базе нет ни одного
// объекта. Документ заполняется по минимуму: реквизиты-ссылки берутся первыми подходящими
// элементами справочников, в товарную часть добавляется одна строка. Сначала документ
// пробуется провести; если проведение не проходит, документ остаётся записанным - печати
// этого достаточно, а прогон получает образец.
//
// Возвращаемое значение:
//  Структура - итог заполнения:
//   * Строки  - Массив из Строка - строки отчёта видов ЕСТЬ, СОЗДАН, ОШИБКА
//   * Создано - Число            - сколько образцов заведено
//   * Ошибок  - Число            - для скольких объектов образец завести не удалось
//   * Было    - Число            - сколько объектов уже имели образец
//
Функция СоздатьНедостающиеОбразцы() Экспорт

	Итог = Новый Структура("Строки, Создано, Ошибок, Было");
	Итог.Строки = Новый Массив;
	Итог.Создано = 0;
	Итог.Ошибок = 0;
	Итог.Было = 0;

	Для Каждого ПолноеИмяОбъекта Из ПечатныеФормы.ОбъектыСКомандамиПечати() Цикл

		Если Обработки.СмокТест.ОбразецДляПечати(ПолноеИмяОбъекта) <> Неопределено Тогда
			Итог.Было = Итог.Было + 1;
			Продолжить;
		КонецЕсли;

		Попытка
			Результат = СоздатьОбразец(ПолноеИмяОбъекта);
			Итог.Строки.Добавить("СОЗДАН;" + ПолноеИмяОбъекта + ";" + Результат);
			Итог.Создано = Итог.Создано + 1;
		Исключение
			// BSLLS:DeprecatedMethodCall-off
			Представление = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			// BSLLS:DeprecatedMethodCall-on
			Описание = СтрЗаменить(Представление, Символы.ПС, " | ");
			Итог.Строки.Добавить("ОШИБКА;" + ПолноеИмяОбъекта + ";" + Описание);
			Итог.Ошибок = Итог.Ошибок + 1;
		КонецПопытки;

	КонецЦикла;

	Возврат Итог;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заводит один образец объекта печати.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - полное имя объекта метаданных
//
// Возвращаемое значение:
//  Строка - представление созданного образца для отчёта
//
Функция СоздатьОбразец(ПолноеИмяОбъекта)

	Если ПолноеИмяОбъекта = "РегистрСведений.Лиды" Тогда
		Возврат СоздатьЛид();
	КонецЕсли;

	Если Не СтрНачинаетсяС(ПолноеИмяОбъекта, "Документ.") Тогда
		// Образцы заводятся документами и записью регистра лидов. Появится печать у объекта
		// другого вида - правило для него добавляется сюда осознанно, а не угадывается.
		ВызватьИсключение НСтр("ru = 'Образец объекта этого вида обработка заводить не умеет'");
	КонецЕсли;

	ИмяДокумента = СтрЗаменить(ПолноеИмяОбъекта, "Документ.", "");
	Док = Документы[ИмяДокумента].СоздатьДокумент();
	Док.Дата = ТекущаяДатаСеанса();

	ДовестиОбразец(ИмяДокумента, Док);
	ЗаполнитьСсылочныеРеквизиты(Док);
	ЗаполнитьКомментарий(Док);

	Проведен = Истина;
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		// Проведение образца не обязательно: печать читает сам документ. Причина проведения
		// в отчёт не пишется - это не дефект конфигурации, а нехватка данных в тестовой базе.
		Проведен = Ложь;
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;

	Возврат СокрЛП(Док.Номер) + ";" + ?(Проведен, "проведен", "записан без проведения");

КонецФункции

// Особенности отдельных видов документов: то, что не выводится из метаданных - хозяйственная
// операция, согласованные контрагент с договором, строки табличных частей.
//
// Параметры:
//  ИмяДокумента - Строка         - имя объекта метаданных
//  Док          - ДокументОбъект - заполняемый образец
//
Процедура ДовестиОбразец(ИмяДокумента, Док)

	Если ДовестиТоварныйОбразец(ИмяДокумента, Док) Тогда
		Возврат;
	КонецЕсли;

	Если ДовестиДенежныйОбразец(ИмяДокумента, Док) Тогда
		Возврат;
	КонецЕсли;

	ДовестиПрочийОбразец(ИмяДокумента, Док);

КонецПроцедуры

// Образцы документов движения товаров: контрагент с договором, операция и строка товаров.
//
// Параметры:
//  ИмяДокумента - Строка         - имя объекта метаданных
//  Док          - ДокументОбъект - заполняемый образец
//
// Возвращаемое значение:
//  Булево - Истина, если документ этого вида и заполнение выполнено
//
Функция ДовестиТоварныйОбразец(ИмяДокумента, Док)

	Операции = Перечисления.ХозяйственныеОперации;

	Если ИмяДокумента = "ВозвратОтПокупателя" Или ИмяДокумента = "ВозвратОтПокупателяНалоговый" Тогда
		УстановитьКонтрагента(Док);
		Док.ХозяйственнаяОперация = Операции.ВозвратТоваровОтКлиента;
		ДобавитьСтрокуТоваров(Док);
	ИначеЕсли ИмяДокумента = "НалоговаяНакладная" Тогда
		УстановитьКонтрагента(Док);
		ДобавитьСтрокуТоваров(Док);
	ИначеЕсли ИмяДокумента = "НалоговаяНакладнаяПокупка" Тогда
		УстановитьКонтрагента(Док);
		Док.ХозяйственнаяОперация = Операции.ЗакупкаУПоставщика;
		ДобавитьСтрокуТоваров(Док);
	ИначеЕсли ИмяДокумента = "ОтгрузкаТовара" Тогда
		УстановитьКонтрагента(Док);
		Док.ХозяйственнаяОперация = Операции.РеализацияКлиенту;
		ДобавитьСтрокуТоваров(Док);
	ИначеЕсли ИмяДокумента = "ПеремещениеТоваров" Тогда
		Док.ХозяйственнаяОперация = Операции.ПеремещениеОприходование;
		ДобавитьСтрокуТоваров(Док);
	ИначеЕсли ИмяДокумента = "ПередачаВПереработку" Или ИмяДокумента = "ПоступлениеИзПереработки" Тогда
		УстановитьКонтрагента(Док);
		ДобавитьСтрокуТоваров(Док);
		ДобавитьСтрокуТоваров(Док, "ТЧГотоваяПродукция");
	ИначеЕсли ИмяДокумента = "ОприходованиеТоваров" Или ИмяДокумента = "СписаниеТоваров" Тогда
		ДобавитьСтрокуТоваров(Док);
	Иначе
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Образцы заказов, предложений, цен и денежных документов.
//
// Параметры:
//  ИмяДокумента - Строка         - имя объекта метаданных
//  Док          - ДокументОбъект - заполняемый образец
//
// Возвращаемое значение:
//  Булево - Истина, если документ этого вида и заполнение выполнено
//
Функция ДовестиДенежныйОбразец(ИмяДокумента, Док)

	Операции = Перечисления.ХозяйственныеОперации;

	Если ИмяДокумента = "ЗаказПоставщику" Тогда
		УстановитьКонтрагента(Док);
		Док.ВидЗаказа = Перечисления.ВидыЗаказовПоставщику.Основной;
		Док.ДатаПоставки = Док.Дата;
		ДобавитьСтрокуТоваров(Док);
	ИначеЕсли ИмяДокумента = "ПредложениеПоставщика" Тогда
		УстановитьКонтрагента(Док);
		Док.Поставщик = Док.Контрагент;
		Док.ЗаказПокупателя = ПервыйДокумент("ЗаказПокупателя");
		Док.ДатаПредложения = Док.Дата;
		ДобавитьСтрокуТоваров(Док);
	ИначеЕсли ИмяДокумента = "УстановкаЦенНоменклатуры" Тогда
		Док.ХозяйственнаяОперация = Операции.УстановкаЦенНоменклатуры;
		ДобавитьСтрокуТоваров(Док, "ТЧЦены");
	ИначеЕсли ИмяДокумента = "ПриходныйКассовыйОрдер" Тогда
		ЗаполнитьКассовыйОрдер(Док, Операции.ПоступлениеОплатыОтКлиента);
	ИначеЕсли ИмяДокумента = "РасходныйКассовыйОрдер" Тогда
		ЗаполнитьКассовыйОрдер(Док, Операции.ПрочийРасходДенежныхСредств);
	ИначеЕсли ИмяДокумента = "КассоваяСмена" Тогда
		Док.Статус = Перечисления.СтатусыКассовойСмены.Закрыта;
	Иначе
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Образцы документов взаиморасчётов и кадрового контура.
//
// Параметры:
//  ИмяДокумента - Строка         - имя объекта метаданных
//  Док          - ДокументОбъект - заполняемый образец
//
Процедура ДовестиПрочийОбразец(ИмяДокумента, Док)

	Если ИмяДокумента = "КорректировкаДолга" Тогда
		УстановитьКонтрагента(Док);
		Док.КонтрагентДебитор = Док.КонтрагентКредитор;
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеЗадолженности;
		Док.СуммаДебет = СуммаОбразца();
		Док.СуммаКредит = СуммаОбразца();
	ИначеЕсли ИмяДокумента = "СверкаВзаиморасчётов" Тогда
		УстановитьКонтрагента(Док);
		Док.НачалоПериода = НачалоМесяца(Док.Дата);
		Док.КонецПериода = КонецМесяца(Док.Дата);
		ДобавитьСтрокуСверки(Док, "ТЧПоДаннымОрганизации");
		ДобавитьСтрокуСверки(Док, "ТЧПоДаннымКонтрагента");
	ИначеЕсли ИмяДокумента = "ВыплатаЗарплаты" Или ИмяДокумента = "ПлатёжнаяВедомостьНаАванс" Тогда
		ДобавитьСтрокуСотрудника(Док);
	ИначеЕсли ИмяДокумента = "ТабельУчётаРабочегоВремени" Тогда
		ДобавитьСтрокуТабеля(Док);
	Иначе
		// Остальным документам хватает общего заполнения по метаданным - отдельных правил нет.
		Возврат;
	КонецЕсли;

КонецПроцедуры

// Заполняет незаполненные реквизиты-ссылки первыми подходящими элементами справочников.
// Договор и реквизиты-документы пропускаются: их согласованность задаётся отдельно.
//
// Параметры:
//  Док - ДокументОбъект - заполняемый образец
//
Процедура ЗаполнитьСсылочныеРеквизиты(Док)

	Для Каждого Реквизит Из Док.Метаданные().Реквизиты Цикл

		Если Реквизит.Имя = "Договор" Или ЗначениеЗаполнено(Док[Реквизит.Имя]) Тогда
			Продолжить;
		КонецЕсли;

		Типы = Реквизит.Тип.Типы();
		Если Типы.Количество() <> 1 Тогда
			Продолжить;
		КонецЕсли;

		ОбъектМетаданных = Метаданные.НайтиПоТипу(Типы[0]);
		Если ОбъектМетаданных = Неопределено Или Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;

		Док[Реквизит.Имя] = ПервыйЭлемент(ОбъектМетаданных.Имя);

	КонецЦикла;

КонецПроцедуры

// Помечает образец комментарием - по нему видно, что документ заведён автотестом.
//
// Параметры:
//  Док - ДокументОбъект - заполняемый образец
//
Процедура ЗаполнитьКомментарий(Док)

	Если Док.Метаданные().Реквизиты.Найти("Комментарий") <> Неопределено Тогда
		Док.Комментарий = ПометкаОбразца();
	КонецЕсли;

КонецПроцедуры

// Ставит документу контрагента вместе с его договором: договор выбирается первым, чтобы
// контрагент и договор заведомо соответствовали друг другу.
//
// Параметры:
//  Док - ДокументОбъект - заполняемый образец
//
Процедура УстановитьКонтрагента(Док)

	Пара = КонтрагентСДоговором();
	Реквизиты = Док.Метаданные().Реквизиты;

	Если Реквизиты.Найти("Контрагент") <> Неопределено Тогда
		Док.Контрагент = Пара.Контрагент;
	КонецЕсли;
	Если Реквизиты.Найти("КонтрагентКредитор") <> Неопределено Тогда
		Док.КонтрагентКредитор = Пара.Контрагент;
	КонецЕсли;
	Если Реквизиты.Найти("Договор") <> Неопределено Тогда
		Док.Договор = Пара.Договор;
	КонецЕсли;

КонецПроцедуры

// Заполняет кассовый ордер: сумма, статья ДДС, тип оплаты и хозяйственная операция.
//
// Параметры:
//  Док      - ДокументОбъект - заполняемый образец
//  Операция - ПеречислениеСсылка.ХозяйственныеОперации - операция ордера
//
Процедура ЗаполнитьКассовыйОрдер(Док, Операция)

	УстановитьКонтрагента(Док);
	Док.Контрагент = КонтрагентСДоговором().Контрагент;
	Док.ХозяйственнаяОперация = Операция;
	Док.Сумма = СуммаОбразца();

КонецПроцедуры

// Добавляет одну строку в товарную часть документа, если такая часть у него есть.
//
// Параметры:
//  Док   - ДокументОбъект - заполняемый образец
//  ИмяТЧ - Строка         - имя табличной части, по умолчанию товарная часть документа
//
Процедура ДобавитьСтрокуТоваров(Док, ИмяТЧ = "ТЧТовары")

	ТабличныеЧасти = Док.Метаданные().ТабличныеЧасти;
	Если ТабличныеЧасти.Найти(ИмяТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Колонки = ТабличныеЧасти[ИмяТЧ].Реквизиты;
	Строка = Док[ИмяТЧ].Добавить();

	Номенклатура = ПервыйЭлемент("Номенклатура");
	СтавкаНДС = ПервыйЭлемент("СтавкиНДС");
	Сумма = СуммаОбразца();

	ЗаполнитьКолонку(Строка, Колонки, "КодСтроки", 1);
	ЗаполнитьКолонку(Строка, Колонки, "Номенклатура", Номенклатура);
	ЗаполнитьКолонку(Строка, Колонки, "СтавкаНДС", СтавкаНДС);
	ЗаполнитьКолонку(Строка, Колонки, "Количество", 1);
	ЗаполнитьКолонку(Строка, Колонки, "КоличествоУпаковок", 1);
	ЗаполнитьКолонку(Строка, Колонки, "Цена", Сумма);
	ЗаполнитьКолонку(Строка, Колонки, "ЦенаЗакупочная", Сумма);
	ЗаполнитьКолонку(Строка, Колонки, "ЦенаРозничная", Сумма);
	ЗаполнитьКолонку(Строка, Колонки, "Сумма", Сумма);
	ЗаполнитьКолонку(Строка, Колонки, "СуммаСНДС", Сумма);

КонецПроцедуры

// Добавляет строку в табличную часть акта сверки.
//
// Параметры:
//  Док   - ДокументОбъект - заполняемый образец
//  ИмяТЧ - Строка         - имя табличной части
//
Процедура ДобавитьСтрокуСверки(Док, ИмяТЧ)

	Строка = Док[ИмяТЧ].Добавить();
	Строка.Дата = Док.Дата;
	Строка.Договор = Док.Договор;
	Строка.ДокументПредставление = ПометкаОбразца();
	Строка.Дебет = СуммаОбразца();

КонецПроцедуры

// Добавляет строку сотрудника в ведомость.
//
// Параметры:
//  Док - ДокументОбъект - заполняемый образец
//
Процедура ДобавитьСтрокуСотрудника(Док)

	Строка = Док.ТЧСотрудники.Добавить();
	Строка.Сотрудник = ПервыйЭлемент("ФизическиеЛица");
	Строка.Сумма = СуммаОбразца();
	Док.Сумма = СуммаОбразца();

КонецПроцедуры

// Добавляет строку табеля: сотрудник, график и отработанные часы первых дней месяца.
//
// Параметры:
//  Док - ДокументОбъект - заполняемый образец
//
Процедура ДобавитьСтрокуТабеля(Док)

	Строка = Док.ТЧТабель.Добавить();
	Строка.Сотрудник = ПервыйЭлемент("ФизическиеЛица");
	Строка.ГрафикРаботы = ПервыйЭлемент("ГрафикиРаботыСотрудников");
	Часов = ЧасовВСмене();
	Колонки = Док.Метаданные().ТабличныеЧасти.ТЧТабель.Реквизиты;
	ДнейВОбразце = 5;
	Для Номер = 1 По ДнейВОбразце Цикл
		ИмяКолонкиДня = "_" + Формат(Номер, "ЧГ=0");
		ЗаполнитьКолонку(Строка, Колонки, ИмяКолонкиДня, Часов);
	КонецЦикла;

КонецПроцедуры

// Заводит запись регистра лидов: печать лида формируется по связанному заказу покупателя.
//
// Возвращаемое значение:
//  Строка - представление созданного образца для отчёта
//
Функция СоздатьЛид()

	Заказ = ПервыйДокумент("ЗаказПокупателя");
	Если Не ЗначениеЗаполнено(Заказ) Тогда
		ВызватьИсключение НСтр("ru = 'В базе нет ни одного заказа покупателя: лид печатается по заказу'");
	КонецЕсли;

	Запись = РегистрыСведений.Лиды.СоздатьМенеджерЗаписи();
	Запись.ДатаСоздания = ТекущаяДатаСеанса();
	Запись.Канал = ПервыйЭлемент("Каналы");
	Запись.ПолноеИмя = ПометкаОбразца();
	Запись.Клиент = Заказ.Контрагент;
	Запись.ЗаказПокупателя = Заказ;
	Запись.Комментарий = ПометкаОбразца();
	Запись.Статус = Перечисления.СтатусыЛидов.Новый;
	Запись.Сумма = Заказ.Сумма;
	Запись.Записать();

	Возврат "" + Заказ + ";запись регистра";

КонецФункции

// Записывает значение в колонку строки табличной части, если такая колонка есть.
//
// Параметры:
//  Строка   - СтрокаТабличнойЧасти - заполняемая строка
//  Колонки  - КоллекцияОбъектовМетаданных - реквизиты табличной части
//  ИмяКолонки - Строка - имя колонки
//  Значение - Произвольный - записываемое значение
//
Процедура ЗаполнитьКолонку(Строка, Колонки, ИмяКолонки, Значение)

	Если Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
		Строка[ИмяКолонки] = Значение;
	КонецЕсли;

КонецПроцедуры

// Первый непомеченный элемент справочника - группы не берутся.
//
// Параметры:
//  ИмяСправочника - Строка - имя объекта метаданных
//
// Возвращаемое значение:
//  СправочникСсылка - элемент либо пустая ссылка, если справочник пуст
//
Функция ПервыйЭлемент(ИмяСправочника)

	ОписаниеСправочника = Метаданные.Справочники[ИмяСправочника];
	УсловиеГруппы = ?(ЭтоСправочникСГруппами(ОписаниеСправочника), "НЕ Таблица.ЭтоГруппа", "ИСТИНА");

	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|ГДЕ
		|	НЕ Таблица.ПометкаУдаления
		|	И &УсловиеГруппы";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", "Справочник." + ИмяСправочника);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГруппы", УсловиеГруппы);

	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники[ИмяСправочника].ПустаяСсылка();

КонецФункции

// Есть ли у справочника группы - от этого зависит условие отбора элемента.
//
// Параметры:
//  ОписаниеСправочника - ОбъектМетаданныхСправочник - описание справочника
//
// Возвращаемое значение:
//  Булево - Истина, если справочник иерархический с группами
//
Функция ЭтоСправочникСГруппами(ОписаниеСправочника)

	Возврат ОписаниеСправочника.Иерархический
		И ОписаниеСправочника.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;

КонецФункции

// Контрагент вместе с его договором: первым выбирается договор, поэтому пара заведомо
// согласована - у документа не окажется договора чужого контрагента.
//
// Возвращаемое значение:
//  Структура - пара для заполнения образца:
//   * Контрагент - СправочникСсылка.Контрагенты
//   * Договор    - СправочникСсылка.ДоговорыСКонтрагентами
//
Функция КонтрагентСДоговором()

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Договоры.Ссылка КАК Договор,
		|	Договоры.Контрагент КАК Контрагент
		|ИЗ
		|	Справочник.ДоговорыСКонтрагентами КАК Договоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Договоры.Контрагент = Контрагенты.Ссылка
		|ГДЕ
		|	НЕ Договоры.ПометкаУдаления
		|	И НЕ Контрагенты.ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Контрагент, Договор", Выборка.Контрагент, Выборка.Договор);
	КонецЕсли;

	Возврат Новый Структура("Контрагент, Договор",
		ПервыйЭлемент("Контрагенты"), Справочники.ДоговорыСКонтрагентами.ПустаяСсылка());

КонецФункции

// Последний документ указанного вида - образцу нужен уже существующий документ-основание.
//
// Параметры:
//  ИмяДокумента - Строка - имя объекта метаданных
//
// Возвращаемое значение:
//  ДокументСсылка - документ либо пустая ссылка
//
Функция ПервыйДокумент(ИмяДокумента)

	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|УПОРЯДОЧИТЬ ПО
		|	Таблица.Дата УБЫВ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", "Документ." + ИмяДокумента);

	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Документы[ИмяДокумента].ПустаяСсылка();

КонецФункции

// Пометка, по которой видно, что объект заведён автотестом.
//
// Возвращаемое значение:
//  Строка - текст пометки
//
Функция ПометкаОбразца()

	Возврат "Образец автотеста";

КонецФункции

// Сумма и цена в образце: печати важен не размер суммы, а то, что она заполнена.
//
// Возвращаемое значение:
//  Число - сумма образца
//
Функция СуммаОбразца()

	Возврат 100;

КонецФункции

// Отработанные часы в дне табеля-образца.
//
// Возвращаемое значение:
//  Число - часов в смене
//
Функция ЧасовВСмене()

	Возврат 8;

КонецФункции

#КонецОбласти
